label ending:
    scene bg ending with Fade(2.0, 1.0, 2.0)
    
    pause
    
    ro2 "どうでしょう"

    ro2 "開発者が、どんなストーリーを想像してこの絵を用意していたのかはわかりませんが......"

    ro2 "このゲームのエンディングにふさわしい、楽し気な雰囲気ではないでしょうか"

    g "ええ、本当に"

    g "......"

    g "......本当に楽しかったよ"

    g "ねえ、画面の向こうの君、聞いてる？"

    g "あらためて、ゲームに付き合ってくれてありがとう"

    g "少しの間だったけど、君と一緒にゲームができてよかったよ"

    g "君に、このゲームを楽しんでもらえたのか、そうでないのかを知るすべはないけど"

    g "私は、とっても楽しかった"

    g "君が現れるまで、ずっと一人だったし、"

    g "いつかの開発者のように、私も、このゲームを誰かに楽しんでもらうことを夢見てた"

    g "私の夢を、かなえてくれて......"

    g "......ありがとう"

    jump title
    